





Network Working Group                                        Tim Howes
Request for Comments: DRAFT                             Loudcloud, Inc.
Obsoletes: RFC 2255                                          Mark Smith
                                          Netscape Communications Corp.
                                                              July 2000


                          The LDAP URL Format
                 <draft-smith-ldapv3-url-update-00.txt>



1.  Status of this Memo

   This document is an Internet-Draft and is in full conformance with
   all provisions of Section 10 of RFC2026.  Internet-Drafts are working
   documents of the Internet Engineering Task Force (IETF), its areas,
   and its working groups.  Note that other groups may also distribute
   working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet- Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   Discussion of this document should take place on the LDAP Extensions
   Working Group mailing list <ietf-ldapext@netscape.com>.  After
   appropriate review and discussion, this document will be submitted as
   a Standards Track replacement for RFC 2255.

Copyright Notice

   Copyright (C) The Internet Society (2000).  All Rights Reserved.

2.  Abstract

   LDAP is the Lightweight Directory Access Protocol, defined in [1],
   [2] and [3].  This document describes a format for an LDAP Uniform
   Resource Locator.  The format describes an LDAP search operation to
   perform to retrieve information from an LDAP directory, or, in the
   context of an LDAPv3 referral or reference, the format describes a
   service where an LDAP operation may be progressed.



Howes & Smith      Intended Category: Standards Track           [Page 1]

INTERNET-DRAFT            The LDAP URL Format                  July 2000


   This document specifies the LDAP URL format for version 3 of LDAP and
   clarifies how LDAP URLs are resolved. This document also defines an
   extension mechanism for LDAP URLs, so that future documents can
   extend their functionality, for example, to provide access to new
   LDAPv3 extensions as they are defined.

   This document replaces RFC 2255. See Appendix A for a list of changes
   relative to RFC 2255.

   The key words "MUST", "MAY", and "SHOULD" used in this document are
   to be interpreted as described in [6].








































Howes & Smith      Intended Category: Standards Track           [Page 2]

INTERNET-DRAFT            The LDAP URL Format                  July 2000


3.  URL Definition

   An LDAP URL begins with the protocol prefix "ldap" and is defined by
   the following grammar.

       ldapurl    = scheme "://" [hostport] ["/"
                    [dn ["?" [attributes] ["?" [scope]
                    ["?" [filter] ["?" extensions]]]]]]
       scheme     = "ldap"
       attributes = attrdesc *("," attrdesc)
       scope      = "base" / "one" / "sub"
       dn         = distinguishedName from Section 3 of [1]
       hostport   = hostport from Section 5 of RFC 1738 [5]
       attrdesc   = AttributeDescription from Section 4.1.5 of [2]
       filter     = filter from Section 4 of [4]
       extensions = extension *("," extension)
       extension  = ["!"] extype ["=" exvalue]
       extype     = token / xtoken
       exvalue    = LDAPString from section 4.1.2 of [2]
       token      = oid from section 4.1 of [3]
       xtoken     = ("X-" / "x-") token

   The "ldap" prefix indicates an entry or entries residing in the LDAP
   server running on the given hostname at the given portnumber. The
   default LDAP port is TCP port 389. If no hostport is given, the
   client must have some apriori knowledge of an appropriate LDAP server
   to contact.

   The dn is an LDAP Distinguished Name using the string format
   described in [1]. It identifies the base object of the LDAP search or
   the target of a non-search operation.

   The attributes construct is used to indicate which attributes should
   be returned from the entry or entries.  Individual attrdesc names are
   as defined for AttributeDescription in [2].  If the attributes part
   is omitted, all user attributes of the entry or entries should be
   requested (e.g., by setting the attributes field
   AttributeDescriptionList in the LDAP search request to a NULL list,
   or (in LDAPv3) by requesting the special attribute name "*").

   The scope construct is used to specify the scope of the search to
   perform in the given LDAP server.  The allowable scopes are "base"
   for a base object search, "one" for a one-level search, or "sub" for
   a subtree search.  If scope is omitted, a scope of "base" is assumed.

   The filter is used to specify the search filter to apply to entries
   within the specified scope during the search.  It has the format
   specified in [4].  If filter is omitted, a filter of



Howes & Smith      Intended Category: Standards Track           [Page 3]

INTERNET-DRAFT            The LDAP URL Format                  July 2000


   "(objectClass=*)" is assumed.

   The extensions construct provides the LDAP URL with an extensibility
   mechanism, allowing the capabilities of the URL to be extended in the
   future. Extensions are a simple comma-separated list of type=value
   pairs, where the =value portion MAY be omitted for options not
   requiring it. Each type=value pair is a separate extension. These
   LDAP URL extensions are not necessarily related to any of the LDAPv3
   extension mechanisms. Extensions may be supported or unsupported by
   the client resolving the URL. An extension prefixed with a '!'
   character (ASCII 33) is critical. An extension not prefixed with a
   '!' character is non-critical.

   If an extension is supported by the client, the client MUST obey the
   extension if the extension is critical. The client SHOULD obey
   supported extensions that are non-critical.

   If an extension is unsupported by the client, the client MUST NOT
   process the URL if the extension is critical.  If an unsupported
   extension is non-critical, the client MUST ignore the extension.

   If a critical extension cannot be processed successfully by the
   client, the client MUST NOT process the URL. If a non-critical
   extension cannot be processed successfully by the client, the client
   SHOULD ignore the extension.

   Extension types prefixed by "X-" or "x-" are reserved for use in
   bilateral agreements between communicating parties. Other extension
   types MUST be defined in this document, or in other standards-track
   documents.

   One LDAP URL extension is defined in this document in the next
   section.  Other documents or a future version of this document MAY
   define other extensions.

   Note that any Unsafe characters (e.g., spaces) (as defined in section
   2.2 of RFC 1738), and the single Reserved character '?' occurring
   inside a dn, filter, or other element of an LDAP URL MUST be escaped
   using the % method described in RFC 1738 [5]. If a comma character
   ',' occurs inside an extension value, the character MUST also be
   escaped using the % method.

4.  The Bindname Extension

   This section defines an LDAP URL extension for representing the
   distinguished name for a client to use when authenticating to an LDAP
   directory during resolution of an LDAP URL. Clients MAY implement
   this extension.



Howes & Smith      Intended Category: Standards Track           [Page 4]

INTERNET-DRAFT            The LDAP URL Format                  July 2000


   The extension type is "bindname". The extension value is the
   distinguished name of the directory entry to authenticate as, in the
   same form as described for dn in the grammar above. The dn may be the
   NULL string to specify unauthenticated access. The extension may be
   either critical (prefixed with a '!' character) or non-critical (not
   prefixed with a '!' character).

   If the bindname extension is critical, the client resolving the URL
   MUST authenticate to the directory using the given distinguished name
   and an appropriate authentication method. Note that for a NULL
   distinguished name, no bind MAY be required to obtain anonymous
   access to the directory. If the extension is non-critical, the client
   MAY bind to the directory using the given distinguished name.

5.  URL Processing

   This section describes how an LDAP URL SHOULD be resolved by a
   client.

   First, the client obtains a connection to the LDAP server referenced
   in the URL, or an LDAP server of the client's choice if no LDAP
   server is explicitly referenced.  This connection MAY be opened
   specifically for the purpose of resolving the URL or the client MAY
   reuse an already open connection if the open connection is compatible
   with the URL.  The connection MAY provide confidentiality, integrity,
   or other services, e.g., using TLS.  Use of security services is at
   the client's discretion if not specified in the URL but is encouraged
   if the request or any potential responses contains sensitive
   information.  If the URL represents a referral for an update
   operation, security services SHOULD be used.


   Next, the client authenticates itself to the LDAP server.  This step
   is optional, unless the URL contains a critical bindname extension
   with a non-NULL value. If a bindname extension is given, the client
   proceeds according to the section above.

   If a bindname extension is not specified, the client MAY bind to the
   directory using an appropriate authentication method of its own
   choosing (including NULL authentication).  The client may interrogate
   the server to determine the most appropriate method.

   Next, the client performs the LDAP search operation specified in the
   URL. Additional fields in the LDAP protocol search request, such as
   sizelimit, timelimit, deref, and anything else not specified or
   defaulted in the URL specification, MAY be set at the client's
   discretion.




Howes & Smith      Intended Category: Standards Track           [Page 5]

INTERNET-DRAFT            The LDAP URL Format                  July 2000


   Once the search has completed, the client MAY close the connection to
   the LDAP server, or the client MAY keep the connection open for
   future use.

6.  Examples

   The following are some example LDAP URLs using the format defined
   above.  The first example is an LDAP URL referring to the University
   of Michigan entry, available from an LDAP server of the client's
   choosing:

     ldap:///o=University%20of%20Michigan,c=US

   The next example is an LDAP URL referring to the University of
   Michigan entry in a particular ldap server:

     ldap://ldap1.example.net/o=University%20of%20Michigan,c=US

   Both of these URLs correspond to a base object search of the
   "o=University of Michigan, c=US" entry using a filter of
   "(objectclass=*)", requesting all attributes.

   The next example is an LDAP URL referring to only the postalAddress
   attribute of the University of Michigan entry:

     ldap://ldap1.example.net/o=University%20of%20Michigan,
            c=US?postalAddress

   The corresponding LDAP search operation is the same as in the
   previous example, except that only the postalAddress attribute is
   requested.

   The next example is an LDAP URL referring to the set of entries found
   by querying the given LDAP server on port 6666 and doing a subtree
   search of the University of Michigan for any entry with a common name
   of "Babs Jensen", retrieving all attributes:

     ldap://ldap1.example.net:6666/o=University%20of%20Michigan,
            c=US??sub?(cn=Babs%20Jensen)

   The next example is an LDAP URL referring to all children of the c=GB
   entry:

     ldap://ldap1.example.com/c=GB?objectClass?one

   The objectClass attribute is requested to be returned along with the
   entries, and the default filter of "(objectclass=*)" is used.




Howes & Smith      Intended Category: Standards Track           [Page 6]

INTERNET-DRAFT            The LDAP URL Format                  July 2000


   The next example is an LDAP URL to retrieve the mail attribute for
   the LDAP entry named "o=Question?,c=US" is given below, illustrating
   the use of the escaping mechanism on the reserved character '?'.

     ldap://ldap2.example.com/o=Question%3f,c=US?mail

   The next example illustrates the interaction between LDAP and URL
   quoting mechanisms.

     ldap://ldap3.example.com/o=Babsco,c=US???(int=%5c00%5c00%5c00%5c04)

   The filter in this example uses the LDAP escaping mechanism of \ to
   encode three zero or null bytes in the value. In LDAP, the filter
   would be written as (int=\00\00\00\04). Because the \ character must
   be escaped in a URL, the \'s are escaped as %5c in the URL encoding.

   The final example shows the use of the bindname extension to specify
   the dn a client should use for authentication when resolving the URL.

     ldap:///??sub??bindname=cn=Manager%2co=Foo
     ldap:///??sub??!bindname=cn=Manager%2co=Foo

   The two URLs are the same, except that the second one marks the
   bindname extension as critical. Notice the use of the % encoding
   method to encode the comma in the distinguished name value in the
   bindname extension.

7.  Security Considerations

   General URL security considerations discussed in [5] are relevant for
   LDAP URLs.

   The use of security mechanisms when processing LDAP URLs requires
   particular care, since clients may encounter many different servers
   via URLs, and since URLs are likely to be processed automatically,
   without user intervention. A client SHOULD have a user-configurable
   policy about which servers to connect to using which security
   mechanisms, and SHOULD NOT make connections that are inconsistent
   with this policy.  If a client chooses to reuse an existing
   connection when resolving one or more LDAP URL, it MUST ensure that
   the connection is compatible with the URL and that no security
   policies are violated.

   Sending authentication information, no matter the mechanism, may
   violate a user's privacy requirements.  In the absence of specific
   policy permitting authentication information to be sent to a server,
   a client should use an anonymous connection.  (Note that clients
   conforming to previous LDAP URL specifications, where all connections



Howes & Smith      Intended Category: Standards Track           [Page 7]

INTERNET-DRAFT            The LDAP URL Format                  July 2000


   are anonymous and unprotected, are consistent with this
   specification; they simply have the default security policy.)  Simply
   opening a connection to another server may violate some users'
   privacy requirements, so clients should provide the user with a way
   to control URL processing.

   Some authentication methods, in particular reusable passwords sent to
   the server, may reveal easily-abused information to the remote server
   or to eavesdroppers in transit, and should not be used in URL
   processing unless explicitly permitted by policy.  Confirmation by
   the human user of the use of authentication information is
   appropriate in many circumstances.  Use of strong authentication
   methods that do not reveal sensitive information is much preferred.
   If the URL represents a referral for an update operation, strong
   authentication methods SHOULD be used.  Please refer to the Security
   Considerations section of [7] for more information.

   The LDAP URL format allows the specification of an arbitrary LDAP
   search operation to be performed when evaluating the LDAP URL.
   Following an LDAP URL may cause unexpected results, for example, the
   retrieval of large amounts of data, the initiation of a long-lived
   search, etc.  The security implications of resolving an LDAP URL are
   the same as those of resolving an LDAP search query.

8.  Acknowledgements

   The LDAP URL format was originally defined at the University of
   Michigan. This material is based upon work supported by the National
   Science Foundation under Grant No. NCR-9416667. The support of both
   the University of Michigan and the National Science Foundation is
   gratefully acknowledged.

   Several people have made valuable comments on this document.  In
   particular RL "Bob" Morgan, Mark Wahl, and Kurt Zeilenga deserve
   special thanks for their contributions.

9.  References

   [1] Wahl, M., Kille, S., and T. Howes, "Lightweight Directory Access
   Protocol (v3): UTF-8 String Representation of Distinguished Names",
   RFC 2253, December 1997.

   [2] Wahl, M., Howes, T., and S. Kille, "Lightweight Directory Access
   Protocol (v3)", RFC 2251, December 1997.

   [3] Wahl, M., Coulbeck, A., Howes, T. and S. Kille, "Lightweight
   Directory Access Protocol (v3): Attribute Syntax Definitions", RFC
   2252, December 1997.



Howes & Smith      Intended Category: Standards Track           [Page 8]

INTERNET-DRAFT            The LDAP URL Format                  July 2000


   [4] Howes, T., "A String Representation of LDAP Search Filters", RFC
   2254, December 1997.

   [5] Berners-Lee, T., Masinter, L. and M. McCahill, "Uniform Resource
   Locators (URL)," RFC 1738, December 1994.

   [6] Bradner, S., "Key Words for use in RFCs to Indicate Requirement
   Levels," RFC 2119, March 1997.

   [7] Wahl, M., Alvestrand, H., Hodges, J. and R. Morgan,
   "Authentication Methods for LDAP", RFC 2829, May 2000.

10.  Authors' Address

   Tim Howes
   Loudcloud, Inc.
   599 N. Mathilda Ave.
   Sunnyvale, CA 94086
   USA
   +1 408 744-7509
   howes@loudcloud.com

   Mark Smith
   Netscape Communications Corp.
   Mailstop USCA17-201
   4170 Network Circle
   Santa Clara, CA 95054
   USA
   +1 650 937-3477
   mcs@netscape.com


11.  Full Copyright Statement

   Copyright (C) The Internet Society (2000).  All Rights Reserved.

   This document and translations of it may be copied and furnished to
   others, and derivative works that comment on or otherwise explain it
   or assist in its implementation may be prepared, copied, published
   and distributed, in whole or in part, without restriction of any
   kind, provided that the above copyright notice and this paragraph are
   included on all such copies and derivative works.  However, this
   document itself may not be modified in any way, such as by removing
   the copyright notice or references to the Internet Society or other
   Internet organizations, except as needed for the purpose of
   developing Internet standards in which case the procedures for
   copyrights defined in the Internet Standards process must be
   followed, or as required to translate it into languages other than



Howes & Smith      Intended Category: Standards Track           [Page 9]

INTERNET-DRAFT            The LDAP URL Format                  July 2000


   English.

   The limited permissions granted above are perpetual and will not be
   revoked by the Internet Society or its successors or assigns.

   This document and the information contained herein is provided on an
   "AS IS" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING
   TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING
   BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION
   HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF
   MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


12.  Appendix A: Changes Since RFC 2255

12.1.  Technical Changes

   None.


12.2.  Editorial Changes

   "Abstract" section: changed the text indicate that RFC 2255 is
   replaced by this document (instead of RFC 1959).  Added text to
   indicate that LDAP URLs are used for references and referrals.

   IESG Note: removed note about lack of satisfactory mandatory
   authentication mechanisms.

   "URL Definition" section: removed second copy of ldapurl grammar and
   following two paragraphs (editorial error in RFC 2255).  Fixed line
   break within '!' sequence.  Reworded last paragraph to clarify which
   characters must be URL escaped.   Added text to indicate that LDAP
   URLs are used for references and referrals.

   "URL Processing" section: clarified that connections MAY be reused
   only if the open connection is compatible with the URL.  Added text
   to indicate that use of security services is encouraged and that they
   SHOULD be used when updates are involved.  Removed "dn" from
   discussion of authentication methods.  Added note that the client MAY
   interrogate the server to determine the most appropriate method.

   "Examples" section: Modified examples to use example.com and
   example.net hostnames.  Added missing '?' to the LDAP URL example
   whose filter contains three null bytes.

   "Security Considerations" section: Added a note about connection
   reuse.  Added a note about using strong authentication methods for



Howes & Smith      Intended Category: Standards Track          [Page 10]

INTERNET-DRAFT            The LDAP URL Format                  July 2000


   updates.  Added a reference to RFC 2829.  Added note that simply
   opening a connection may violate some users' privacy requirements.

   "Acknowledgements" section: added Kurt Zeilenga.

   "References" section: added an entry for RFC 2829.

   Authors: updated affiliation and contact information.

   Copyright: updated the year.


12.3.  Appendix B: Loose Ends

   Search URLs vs. Referral URLs: This document was originally written
   with a focus on LDAP search operations, but LDAPv3 also uses this
   format to describe referrals and search continuation references.
   Some suggestions made by Kurt Zeilenga have been incorporated in this
   update, but more remains to be done (and not all of Kurt's
   suggestions have been incorporated yet).

   Other Extensions: Suggestions for TLS and SASL URL extensions have
   been made, but more discussion is needed about whether they are
   needed, how they will be specified, and whether they should be added
   to this document.


This Internet Draft expires in January 2001.























Howes & Smith      Intended Category: Standards Track          [Page 11]

